In [11]:
import numpy as np
import pandas as pd

In [12]:
data = {'Yil':[2020, 2021, 2022, 2023],
        'Aholi':[83.4, 83.7, 84.0, 84.3],
        'Temp':[15.2, 15.5, 15.7, 16.0],
        'Zichilik':[105.5, 106.0, 106.5, 107.0]
        }

In [13]:
df = pd.DataFrame(data)

In [14]:
df

    Yil  Aholi  Temp  Zichilik
0  2020   83.4  15.2     105.5
1  2021   83.7  15.5     106.0
2  2022   84.0  15.7     106.5
3  2023   84.3  16.0     107.0

In [15]:
df.index = [20, 21, 22, 23]
df

     Yil  Aholi  Temp  Zichilik
20  2020   83.4  15.2     105.5
21  2021   83.7  15.5     106.0
22  2022   84.0  15.7     106.5
23  2023   84.3  16.0     107.0

In [16]:
df.reindex([20, 21, 22, 23])

     Yil  Aholi  Temp  Zichilik
20  2020   83.4  15.2     105.5
21  2021   83.7  15.5     106.0
22  2022   84.0  15.7     106.5
23  2023   84.3  16.0     107.0

In [17]:
df.reindex(index=range(10, 20), method="nearest")

     Yil  Aholi  Temp  Zichilik
10  2020   83.4  15.2     105.5
11  2020   83.4  15.2     105.5
12  2020   83.4  15.2     105.5
13  2020   83.4  15.2     105.5
14  2020   83.4  15.2     105.5
15  2020   83.4  15.2     105.5
16  2020   83.4  15.2     105.5
17  2020   83.4  15.2     105.5
18  2020   83.4  15.2     105.5
19  2020   83.4  15.2     105.5

In [18]:
df.loc[[20,21,22], ['Aholi' , 'Temp']]

    Aholi  Temp
20   83.4  15.2
21   83.7  15.5
22   84.0  15.7

In [19]:
df

     Yil  Aholi  Temp  Zichilik
20  2020   83.4  15.2     105.5
21  2021   83.7  15.5     106.0
22  2022   84.0  15.7     106.5
23  2023   84.3  16.0     107.0

In [20]:
df_new = df.drop(22)

In [21]:
df_new

     Yil  Aholi  Temp  Zichilik
20  2020   83.4  15.2     105.5
21  2021   83.7  15.5     106.0
23  2023   84.3  16.0     107.0

In [22]:
df.drop([20, 23])

     Yil  Aholi  Temp  Zichilik
21  2021   83.7  15.5     106.0
22  2022   84.0  15.7     106.5

In [23]:
df.drop('Temp', axis=1)

     Yil  Aholi  Zichilik
20  2020   83.4     105.5
21  2021   83.7     106.0
22  2022   84.0     106.5
23  2023   84.3     107.0

In [24]:
df.drop('Temp', axis='columns')

     Yil  Aholi  Zichilik
20  2020   83.4     105.5
21  2021   83.7     106.0
22  2022   84.0     106.5
23  2023   84.3     107.0

In [25]:
df

     Yil  Aholi  Temp  Zichilik
20  2020   83.4  15.2     105.5
21  2021   83.7  15.5     106.0
22  2022   84.0  15.7     106.5
23  2023   84.3  16.0     107.0

In [26]:
df.drop('Yil', axis=1, inplace=True)

In [27]:
df

    Aholi  Temp  Zichilik
20   83.4  15.2     105.5
21   83.7  15.5     106.0
22   84.0  15.7     106.5
23   84.3  16.0     107.0

In [28]:
data = df['Aholi']

In [29]:
data

20    83.4
21    83.7
22    84.0
23    84.3
Name: Aholi, dtype: float64

In [30]:
data[0:2]

20    83.4
21    83.7
Name: Aholi, dtype: float64

In [31]:
data[[21]]

21    83.7
Name: Aholi, dtype: float64

In [32]:
data[[20, 22, 21]]

20    83.4
22    84.0
21    83.7
Name: Aholi, dtype: float64

In [33]:
obj = pd.Series(np.arange(3), index=['a', 'b', 'c'])

In [34]:
obj

a    0
b    1
c    2
dtype: int64

In [35]:
obj[['b']]

b    1
dtype: int64

In [36]:
type(obj[['b']])

pandas.core.series.Series

In [37]:
obj[0:4]

a    0
b    1
c    2
dtype: int64

In [38]:
obj['a':'f'] # a,b,c,d,e,f chiqadi.

a    0
b    1
c    2
dtype: int64

In [39]:
obj['a':'f']

a    0
b    1
c    2
dtype: int64

In [40]:
uz = {2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9, 2016:31.4, 2015:30.9}
kz = {2020:18.8, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8, 2015:17.6}
tj = {2020:9.5, 2019:9.3, 2018:9.1, 2017:8.9, 2016:8.7, 2015:8.5}
kg = {2020:6.5, 2019:6.4, 2018:6.3, 2017:6.2, 2016:6.1, 2015:6.0}
tr = {2020:6.0, 2019:5.9, 2018:5.9, 2017:5.8, 2016:5.6, 2015:5.6}

df = pd.DataFrame(
    {'Uzbekistan':uz,
     'Kazakhstan':kz,
     'Tajikistan':tj,
     'Kyrgizstan':kg,
     'Turkmenistan':tr
    }
)

In [41]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2020        33.5        18.8         9.5         6.5           6.0
2019        32.9        18.5         9.3         6.4           5.9
2018        32.5        18.3         9.1         6.3           5.9
2017        31.9        18.1         8.9         6.2           5.8
2016        31.4        17.8         8.7         6.1           5.6
2015        30.9        17.6         8.5         6.0           5.6

In [42]:
df['Uzbekistan']

2020    33.5
2019    32.9
2018    32.5
2017    31.9
2016    31.4
2015    30.9
Name: Uzbekistan, dtype: float64

In [43]:
df[['Uzbekistan']]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.9
2016        31.4
2015        30.9

In [44]:
df[['Uzbekistan','Turkmenistan']]

      Uzbekistan  Turkmenistan
2020        33.5           6.0
2019        32.9           5.9
2018        32.5           5.9
2017        31.9           5.8
2016        31.4           5.6
2015        30.9           5.6

In [45]:
df[3:]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2017        31.9        18.1         8.9         6.2           5.8
2016        31.4        17.8         8.7         6.1           5.6
2015        30.9        17.6         8.5         6.0           5.6

In [46]:
df>8

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2020        True        True        True       False         False
2019        True        True        True       False         False
2018        True        True        True       False         False
2017        True        True        True       False         False
2016        True        True        True       False         False
2015        True        True        True       False         False

In [47]:
df[['Uzbekistan']][df['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [48]:
df2=df.transpose(copy=True)

In [49]:
df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   9.1   8.9   8.7   8.5
Kyrgizstan     6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [50]:
df2[df2[2015]>6]

            2020  2019  2018  2017  2016  2015
Uzbekistan  33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan  18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan   9.5   9.3   9.1   8.9   8.7   8.5

In [51]:
df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   9.1   8.9   8.7   8.5
Kyrgizstan     6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [52]:
df2[df2<8] = 0

In [53]:

df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   9.1   8.9   8.7   8.5
Kyrgizstan     0.0   0.0   0.0   0.0   0.0   0.0
Turkmenistan   0.0   0.0   0.0   0.0   0.0   0.0

In [54]:
df2[[2020]]

              2020
Uzbekistan    33.5
Kazakhstan    18.8
Tajikistan     9.5
Kyrgizstan     0.0
Turkmenistan   0.0

In [55]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2020        33.5        18.8         9.5         6.5           6.0
2019        32.9        18.5         9.3         6.4           5.9
2018        32.5        18.3         9.1         6.3           5.9
2017        31.9        18.1         8.9         6.2           5.8
2016        31.4        17.8         8.7         6.1           5.6
2015        30.9        17.6         8.5         6.0           5.6

In [56]:
df.loc[[2015]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2015        30.9        17.6         8.5         6.0           5.6

In [57]:
df.loc[[2017,2020]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2017        31.9        18.1         8.9         6.2           5.8
2020        33.5        18.8         9.5         6.5           6.0

In [58]:
df.loc[[2020,2019],['Uzbekistan','Kazakhstan']]

      Uzbekistan  Kazakhstan
2020        33.5        18.8
2019        32.9        18.5

In [59]:
df.iloc[[0,2,4]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizstan  Turkmenistan
2020        33.5        18.8         9.5         6.5           6.0
2018        32.5        18.3         9.1         6.3           5.9
2016        31.4        17.8         8.7         6.1           5.6

In [60]:
df.iloc[[0],[0,3,4]]

      Uzbekistan  Kyrgizstan  Turkmenistan
2020        33.5         6.5           6.0

In [61]:
df.loc[:2017,'Uzbekistan']

2020    33.5
2019    32.9
2018    32.5
2017    31.9
Name: Uzbekistan, dtype: float64

In [62]:
nums = list(range(0,11))
nums

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [64]:
nums[-1]

10

In [65]:
nums = pd.Series(np.arange(10.))
nums

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [68]:
ser = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
ser

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [69]:
ser[-1]

C:\Users\user\AppData\Local\Temp\ipykernel_11400\3387420178.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[-1]

np.float64(4.0)

In [70]:
nums.iloc[-1]

np.float64(9.0)

In [71]:
nums.iloc[4]

np.float64(4.0)

In [72]:
ser.loc['d']

np.float64(3.0)

In [73]:
#Homework